#+DATE: Aug 06 2015, Thu

#+BEGIN_SRC emacs-lisp
(gb-set-filetag "DATE" (format-time-string "%b %d %Y, %a" (current-time)))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp
(setq students '())

(let ((org-use-property-inheritance nil))
  (org-map-entries
   (lambda ()
     (add-to-list 'students (cons (nth 4 (org-heading-components)) '()) t))
 "MAIL_TO={edu}"))

students
#+END_SRC

#+RESULTS:
| Student One   |
| Student Two   |
| Student Three |


#+BEGIN_SRC emacs-lisp
(setq assignments '())
(setq students '())

;; get assignments
(let ((org-use-tag-inheritance nil))
  (org-map-entries
   (lambda ()
     (add-to-list 'assignments (nth 4 (org-heading-components)) t))
   "assignment"))

;; get student names as list of cons cells
(let ((org-use-property-inheritance nil))
  (org-map-entries
   (lambda ()
     (add-to-list 'students (cons (nth 4 (org-heading-components)) '()) t))
 "MAIL_TO={edu}"))

;;loop over entries
(dolist (assignment assignments)
  (save-excursion
    ;; jump to assignment
    (org-open-link-from-string (format "[[*%s]]" assignment))
    ;; map over entries
    (org-map-entries
     (lambda ()
       (let* ((student (car (assoc (nth 4 (org-heading-components)) students))))
	 (when student
	   (setf (cdr (assoc student students))
		 (append (cdr (assoc student students))
			 (list (org-entry-get (point) "GRADE")))))))
     nil 'tree)))

(setq gradebook
      (append (list  (append '("Student") assignments)
		     'hline)
	      students))

(orgtbl-to-csv gradebook nil)
#+END_SRC

#+RESULTS:
: Student,Definition,Darwin
: Student One,10,40
: Student Two,20,50
: Student Three,30,60



#+BEGIN_SRC emacs-lisp
(require 'ov)

(org-map-entries
 (lambda ()
   (when (org-entry-get (point) "GRADE")
     (setq ov (make-overlay (+ 0 (line-end-position))
			    (+ 1 (line-end-position))))
     (overlay-put
      ov 'display
      (format  " grade: %s" (org-entry-get (point) "GRADE"))))))
#+END_SRC

#+RESULTS:
| nil | grade: 10 | grade: 20 | grade: 30 | nil | grade: 40 | grade: 50 | grade: 60 |

#+BEGIN_SRC emacs-lisp
(ov-clear)
#+END_SRC

#+RESULTS:

